pages/quick-ref.org
#+TITLE: L-System Explorer Quick Guide

* Modules
#+BEGIN_VERSE
Why are they called modules and not commands or something else?
Because module is an old term used by botanists for a unit of growth 
("article" in French from the Latin for branch and translated to 
module in English.)

Modules marked *u* are *unimplemented*
Modules marked *p* are *partially implemented*
Modules marked *c* are *changed from TABOP/cpfg*
Modules marked *n* are *new for this implementation*
#+END_VERSE

** Turtle Motion
   Without a parameter move 'step' amount, default 1 unit
|F(d) | move d units w/pen down, records track point, creates geometry |
|f(d) | move d units w/pen up, records track point|
|G(d) | ==== F(d), but does not record track points, creates geometry|
|g(d) | ==== f(d), w/o recording track points|
|@[Mm](x,y,z) | goto position, 'M' draw, creates geometry, or 'm' don't draw |

** Turtle Orientation
#+BEGIN_VERSE
  The turtle maintains three unit vectors, heading (*H*), left (*L*), and up (*U*).
  The turtle home orientation is *H* = +x, *L* = +z, and *U* = +y,
  but L-system Explorer pitches up 90 degrees, initially, so *H* points +y and *L* points -x.

  *** positive yaw (left) rotates *H* towards *L* around *U*. (x -> z around y)
  *** positive pitch (down) rotates *U* towards *H* around *L*. (y -> x around z)
  *** positive roll rotates *L* towards *U* around *H*. (z -> y around x)

  Without a parameter, a turn is 'delta' degrees, default is 90.

  *Note* We make the turtle behave as if it were in a right-handed system, but all the 
  underlying Babylonjs is left-handed. This has some odd consequences when comparing 
  models with TABOP. (If I'd known I could just tell Babylonjs to use a RHS, things 
  would have been simpler.)
#+END_VERSE
  *Orientation modules*
| +(a)                    | yaw left 'a' degrees    ('a' optional) |
| -(a)                    | yaw right 'a' degrees   ('a' optional) |
| &(a)                    | pitch down 'a' degrees  ('a' optional) |
| ^(a)                    | pitch up 'a' degrees    ('a' optional) |
| \(a)                    | roll left 'a' degrees   ('a' optional) |
| /(a)                    | roll right 'a' degrees  ('a' optional) |
| \vert                   | yaw 180 degrees                                   |
| @v                      | roll so U is parallel to up [y]                   |
| @R(hx,hy,hz[,ux,uy,uz]) | set heading to [hx,hy,hz]                         |
|                         | set U parallel to [ux,uy,z], if supplied          |
| @H(h)               *n* | set turtle to home position and orientation,      |
|                         | if optional h is 0, then set H to +y,         |
|                         | otherwise, H is +x. Does not draw or record point |

** Turtle Settings
  Defaults without a parameter to one
| ;(i)       | increase or set color/material index           |
| ,(i)       | decrease or set color/material index           |
| @;(n)      | increase or set back face color/material index |
| @,(n)      | decrease or set back face color/material index |
| #(n)       | increase or set line width                     |
| !(n)       | decrease or set line width                     |
| @Tx(n) *u* | set texture index                              |
| @D(s) *u*  | set scale factor of subsequent geometry        |
| @Di(f) *u* | multiply scale factor by f                     |

