pages/quick-ref.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-07 Wed 20:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>L-System Explorer Quick Guide</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">L-System Explorer Quick Guide</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdeee005">1. Modules</a>
<ul>
<li><a href="#orge2eceab">1.1. Turtle Motion</a></li>
<li><a href="#org0c8c2e6">1.2. Turtle Orientation</a></li>
<li><a href="#org3944e0c">1.3. Turtle Settings</a></li>
<li><a href="#org46d6251">1.4. Turtle Geometry</a></li>
<li><a href="#org0e90181">1.5. L-system Geometry and Control</a></li>
</ul>
</li>
<li><a href="#org6f7faf8">2. L-System Syntax</a>
<ul>
<li><a href="#orgcad4d61">2.1. Comments</a></li>
<li><a href="#org83b7a01">2.2. Defines</a></li>
<li><a href="#orgf179b72">2.3. Settings</a></li>
<li><a href="#org9c30a0f">2.4. Variables</a></li>
<li><a href="#org1922295">2.5. Expressions</a></li>
</ul>
</li>
<li><a href="#org3d60cae">3. UI and controls</a>
<ul>
<li><a href="#org0e99d0f">3.1. L-system controls</a></li>
<li><a href="#orgc248b0c">3.2. Turtle controls</a></li>
<li><a href="#org44085b1">3.3. Scene Controls</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdeee005" class="outline-2">
<h2 id="orgdeee005"><span class="section-number-2">1.</span> Modules</h2>
<div class="outline-text-2" id="text-1">
<p class="verse">
Why are they called modules and not commands or something else?<br />
Because module is an old term used by botanists for a unit of growth<br />
("article" in French from the Latin for branch and translated to<br />
module in English.)<br />
<br />
Modules marked <b>u</b> are <b>unimplemented</b><br />
Modules marked <b>p</b> are <b>partially implemented</b><br />
Modules marked <b>c</b> are <b>changed from TABOP/cpfg</b><br />
Modules marked <b>n</b> are <b>new for this implementation</b><br />
</p>
</div>

<div id="outline-container-orge2eceab" class="outline-3">
<h3 id="orge2eceab"><span class="section-number-3">1.1.</span> Turtle Motion</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Without a parameter move 'step' amount, default 1 unit
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">F(d)</td>
<td class="org-left">move d units w/pen down, records track point, creates geometry</td>
</tr>

<tr>
<td class="org-left">f(d)</td>
<td class="org-left">move d units w/pen up, records track point</td>
</tr>

<tr>
<td class="org-left">G(d)</td>
<td class="org-left"><code>==</code> F(d), but does not record track points, creates geometry</td>
</tr>

<tr>
<td class="org-left">g(d)</td>
<td class="org-left"><code>==</code> f(d), w/o recording track points</td>
</tr>

<tr>
<td class="org-left">@[Mm](x,y,z)</td>
<td class="org-left">goto position, 'M' draw, creates geometry, or 'm' don't draw</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0c8c2e6" class="outline-3">
<h3 id="org0c8c2e6"><span class="section-number-3">1.2.</span> Turtle Orientation</h3>
<div class="outline-text-3" id="text-1-2">
<p class="verse">
The turtle maintains three unit vectors, heading (<b>H</b>), left (<b>L</b>), and up (<b>U</b>).<br />
The turtle home orientation is <b>H</b> = +x, <b>L</b> = +z, and <b>U</b> = +y,<br />
but L-system Explorer pitches up 90 degrees, initially, so <b>H</b> points +y and <b>L</b> points -x.<br />
<br />
<b>*</b> positive yaw (left) rotates <b>H</b> towards <b>L</b> around <b>U</b>. (x -&gt; z around y)<br />
<b>*</b> positive pitch (down) rotates <b>U</b> towards <b>H</b> around <b>L</b>. (y -&gt; x around z)<br />
<b>*</b> positive roll rotates <b>L</b> towards <b>U</b> around <b>H</b>. (z -&gt; y around x)<br />
<br />
Without a parameter, a turn is 'delta' degrees, default is 90.<br />
<br />
<b>Note</b> We make the turtle behave as if it were in a right-handed system, but all the<br />
underlying Babylonjs is left-handed. This has some odd consequences when comparing<br />
models with TABOP. (If I'd known I could just tell Babylonjs to use a RHS, things<br />
would have been simpler.)<br />
</p>
<p>
<b>Orientation modules</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">+(a)</td>
<td class="org-left">yaw left 'a' degrees    ('a' optional)</td>
</tr>

<tr>
<td class="org-left">-(a)</td>
<td class="org-left">yaw right 'a' degrees   ('a' optional)</td>
</tr>

<tr>
<td class="org-left">&amp;(a)</td>
<td class="org-left">pitch down 'a' degrees  ('a' optional)</td>
</tr>

<tr>
<td class="org-left">^(a)</td>
<td class="org-left">pitch up 'a' degrees    ('a' optional)</td>
</tr>

<tr>
<td class="org-left">\(a)</td>
<td class="org-left">roll left 'a' degrees   ('a' optional)</td>
</tr>

<tr>
<td class="org-left">/(a)</td>
<td class="org-left">roll right 'a' degrees  ('a' optional)</td>
</tr>

<tr>
<td class="org-left">&vert;</td>
<td class="org-left">yaw 180 degrees</td>
</tr>

<tr>
<td class="org-left">@v</td>
<td class="org-left">roll so U is parallel to up [y]</td>
</tr>

<tr>
<td class="org-left">@R(hx,hy,hz[,ux,uy,uz])</td>
<td class="org-left">set heading to [hx,hy,hz]</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">set U parallel to [ux,uy,z], if supplied</td>
</tr>

<tr>
<td class="org-left">@H(h)               <b>n</b></td>
<td class="org-left">set turtle to home position and orientation,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">if optional h is 0, then set H to +y,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">otherwise, H is +x. Does not draw or record point</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3944e0c" class="outline-3">
<h3 id="org3944e0c"><span class="section-number-3">1.3.</span> Turtle Settings</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Defaults without a parameter to one
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">;(i)</td>
<td class="org-left">increase or set color/material index</td>
</tr>

<tr>
<td class="org-left">,(i)</td>
<td class="org-left">decrease or set color/material index</td>
</tr>

<tr>
<td class="org-left">@;(n)</td>
<td class="org-left">increase or set back face color/material index</td>
</tr>

<tr>
<td class="org-left">@,(n)</td>
<td class="org-left">decrease or set back face color/material index</td>
</tr>

<tr>
<td class="org-left">#(n)</td>
<td class="org-left">increase or set line width</td>
</tr>

<tr>
<td class="org-left">!(n)</td>
<td class="org-left">decrease or set line width</td>
</tr>

<tr>
<td class="org-left">@Tx(n) <b>u</b></td>
<td class="org-left">set texture index</td>
</tr>

<tr>
<td class="org-left">@D(s) <b>u</b></td>
<td class="org-left">set scale factor of subsequent geometry</td>
</tr>

<tr>
<td class="org-left">@Di(f) <b>u</b></td>
<td class="org-left">multiply scale factor by f</td>
</tr>
</tbody>
</table>
</div>
</div>
