pages/quick-ref.org
** Turtle Geometry
In addition to orientation and color/material, the turtle also maintains a /track shape/,
which is the shape that it will extrude in moving when the pen is down. The default track
shape is a circle with an initial size of one.
| @o(d)            | circle of diameter d, centered at turtle position                       |
| @C(d) *u*        | circle of diameter d in HL plane                                        |
| @O(d)            | sphere of diameter d                                                    |
| ~(S,s) *c*       | insert predefined surface S, with optional scale, s                     |
| @Cs(n[,t]) *n*   | start contour with n final pts. n==0 => use just the control pts        |
|                  | t ​=​= 0 => open contour (default), t =​= 1 => closed                      |
| @Ce(id) *n*      | end contour and save it as id (number or string)                        |
| @Ca([t[,a]]) *n* | if t=0 (default), create arc between previous 3 pts                     |
|                  | if t=1, create arc from previous two points, w/ctr at p0,               |
|                  | start at p1, with angle a                                               |
| @Cc([n[,t]]) *n* | create Catmull-Rom spline from previous n points                        |
|                  | n == 0 (default) will use *all* prior generated points.                 |
|                  | t==0 => open (default) , else closed curve.                             |
|                  | This will add 1 + m *(n - (t==0) ? 1 : 0) points to the contour,        |
|                  | where m = contour points per segment (default = 16)                     |
| @Ct(m1,m2) *n*   | create Hermite spline from previous two points, with optional           |
|                  | length multipliers m1 and m2                                            |
| @Cb    *n*       | Create a cubic Bezier spline segment from prior four points             |
| @Cm(m) *n*       | create contour of multiplicity m, default 1, only if closed type        |
| @Cn(n) *n*       | Set the number of points per segment (default = 16). This is for        |
|                  | inserted arcs or  splines; control pts inserted with '.' or f, or g     |
|                  | are used as is. Total points is overridden by initial @Cs(n), if n != 0 |
| @#(id)           | set contour(id) as current track shape. The special id, 'default',      |
|                  | sets the default circle as the track shape                              |
| {                | start polygon                                                           |
| {(0)  *c*        | start path with stepwise control pts, not polygon                       |
| {(1)             | start open path with Hermite spline control pts                         |
| {(2) *u*         | start closed path with Hermite spline control pts                       |
| {(3) *u*         | start open path with B-spline control pts                               |
| {(4) *u*         | start closed path with B-spline control pts                             |
| }[(id)] *p*      | end current polygon/path of any type and extrude contour, With          |
|                  | parameter, id, save path as mesh                                        |
| @Gs              | start Hermite spline path, same as '{(1).', i.e. saves point            |
| @Ge(n,id) *c*    | close path started with @Gs. if n, set # intermediate points.           |
|                  | If 'id', save extrusion as mesh                                         |
| .                | add current position to path, polygon, or contour                       |
| @Gt(m1,m2)       | Set tangent length multipliers - default is 1.2                         |
| @Gr(a1,l1,a2,l2) | Set slope and length of tangent vectors for radius curve                |
| @Gc(n)       *p* | Store control point. Optionally set number of interpolated strips       |


** L-system Geometry and Control
| [               | start branch, pushing state onto stack    |
| ]               | end branch, popping branch state stack    |
| % *p*           | cut modules to end of branch              |
| $(id,scale) *c* | push current Lsystem and use sub-Lsystem id   |
| $               | end current sub-Lsystem, return to previous  |
  
* L-System Syntax
Before parsing, the L-system text is run through a JavaScript cpp parser which handles
comments and macro defines. After than, all empty lines and removed and the system is
parsed. See [[https://github.com/acgessler/cpp.js/blob/master/Readme.md][cpp.js README]] for details on how this differs from standard CPP.
** Comments
   C-style comments, '/​* stuff, including newline */​' are supported.\\
   Single-line '//' style comments are not - they conflict with L-system module syntax.
** Defines
   Lines that start with '#define macro value', 'macro' being some word, create
standard C-style macros where 'macro' is replaced with 'value' in 
the L-system before parsing starts. They are not as powerful as cpp.
