pages/quick-ref.html

<div id="outline-container-org46d6251" class="outline-3">
<h3 id="org46d6251"><span class="section-number-3">1.4.</span> Turtle Geometry</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In addition to orientation and color/material, the turtle also maintains a <i>track shape</i>,
which is the shape that it will extrude in moving when the pen is down. The default track
shape is a circle with an initial size of one.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">@o(d)</td>
<td class="org-left">circle of diameter d, centered at turtle position</td>
</tr>

<tr>
<td class="org-left">@C(d) <b>u</b></td>
<td class="org-left">circle of diameter d in HL plane</td>
</tr>

<tr>
<td class="org-left">@O(d)</td>
<td class="org-left">sphere of diameter d</td>
</tr>

<tr>
<td class="org-left">~(S,s) <b>c</b></td>
<td class="org-left">insert predefined surface S, with optional scale, s</td>
</tr>

<tr>
<td class="org-left">@Cs(n[,t]) <b>n</b></td>
<td class="org-left">start contour with n final pts. n==0 =&gt; use just the control pts</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">t ​=​= 0 =&gt; open contour (default), t =​= 1 =&gt; closed</td>
</tr>

<tr>
<td class="org-left">@Ce(id) <b>n</b></td>
<td class="org-left">end contour and save it as id (number or string)</td>
</tr>

<tr>
<td class="org-left">@Ca([t[,a]]) <b>n</b></td>
<td class="org-left">if t=0 (default), create arc between previous 3 pts</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">if t=1, create arc from previous two points, w/ctr at p0,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">start at p1, with angle a</td>
</tr>

<tr>
<td class="org-left">@Cc([n[,t]]) <b>n</b></td>
<td class="org-left">create Catmull-Rom spline from previous n points</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">n == 0 (default) will use <b>all</b> prior generated points.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">t==0 =&gt; open (default) , else closed curve.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">This will add 1 + m *(n - (t==0) ? 1 : 0) points to the contour,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">where m = contour points per segment (default = 16)</td>
</tr>

<tr>
<td class="org-left">@Ct(m1,m2) <b>n</b></td>
<td class="org-left">create Hermite spline from previous two points, with optional</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">length multipliers m1 and m2</td>
</tr>

<tr>
<td class="org-left">@Cb    <b>n</b></td>
<td class="org-left">Create a cubic Bezier spline segment from prior four points</td>
</tr>

<tr>
<td class="org-left">@Cm(m) <b>n</b></td>
<td class="org-left">create contour of multiplicity m, default 1, only if closed type</td>
</tr>

<tr>
<td class="org-left">@Cn(n) <b>n</b></td>
<td class="org-left">Set the number of points per segment (default = 16). This is for</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">inserted arcs or  splines; control pts inserted with '.' or f, or g</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">are used as is. Total points is overridden by initial @Cs(n), if n != 0</td>
</tr>

<tr>
<td class="org-left">@#(id)</td>
<td class="org-left">set contour(id) as current track shape. The special id, 'default',</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">sets the default circle as the track shape</td>
</tr>

<tr>
<td class="org-left">{</td>
<td class="org-left">start polygon</td>
</tr>

<tr>
<td class="org-left">{(0)  <b>c</b></td>
<td class="org-left">start path with stepwise control pts, not polygon</td>
</tr>

<tr>
<td class="org-left">{(1)</td>
<td class="org-left">start open path with Hermite spline control pts</td>
</tr>

<tr>
<td class="org-left">{(2) <b>u</b></td>
<td class="org-left">start closed path with Hermite spline control pts</td>
</tr>

<tr>
<td class="org-left">{(3) <b>u</b></td>
<td class="org-left">start open path with B-spline control pts</td>
</tr>

<tr>
<td class="org-left">{(4) <b>u</b></td>
<td class="org-left">start closed path with B-spline control pts</td>
</tr>

<tr>
<td class="org-left">}[(id)] <b>p</b></td>
<td class="org-left">end current polygon/path of any type and extrude contour, With</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">parameter, id, save path as mesh</td>
</tr>

<tr>
<td class="org-left">@Gs</td>
<td class="org-left">start Hermite spline path, same as '{(1).', i.e. saves point</td>
</tr>

<tr>
<td class="org-left">@Ge(n,id) <b>c</b></td>
<td class="org-left">close path started with @Gs. if n, set # intermediate points.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">If 'id', save extrusion as mesh</td>
</tr>

<tr>
<td class="org-left">.</td>
<td class="org-left">add current position to path, polygon, or contour</td>
</tr>

<tr>
<td class="org-left">@Gt(m1,m2)</td>
<td class="org-left">Set tangent length multipliers - default is 1.2</td>
</tr>

<tr>
<td class="org-left">@Gr(a1,l1,a2,l2)</td>
<td class="org-left">Set slope and length of tangent vectors for radius curve</td>
</tr>

<tr>
<td class="org-left">@Gc(n)       <b>p</b></td>
<td class="org-left">Store control point. Optionally set number of interpolated strips</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org0e90181" class="outline-3">
<h3 id="org0e90181"><span class="section-number-3">1.5.</span> L-system Geometry and Control</h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">[</td>
<td class="org-left">start branch, pushing state onto stack</td>
</tr>

<tr>
<td class="org-left">]</td>
<td class="org-left">end branch, popping branch state stack</td>
</tr>

<tr>
<td class="org-left">% <b>p</b></td>
<td class="org-left">cut modules to end of branch</td>
</tr>

<tr>
<td class="org-left">$(id,scale) <b>c</b></td>
<td class="org-left">push current Lsystem and use sub-Lsystem id</td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">end current sub-Lsystem, return to previous</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org6f7faf8" class="outline-2">
<h2 id="org6f7faf8"><span class="section-number-2">2.</span> L-System Syntax</h2>
<div class="outline-text-2" id="text-2">
<p>
Before parsing, the L-system text is run through a JavaScript cpp parser which handles
comments and macro defines. After than, all empty lines and removed and the system is
parsed. See <a href="https://github.com/acgessler/cpp.js/blob/master/Readme.md">cpp.js README</a> for details on how this differs from standard CPP.
</p>
</div>
<div id="outline-container-orgcad4d61" class="outline-3">
<h3 id="orgcad4d61"><span class="section-number-3">2.1.</span> Comments</h3>
<div class="outline-text-3" id="text-2-1">
<p>
C-style comments, '/​* stuff, including newline */​' are supported.<br />
Single-line '//' style comments are not - they conflict with L-system module syntax.
</p>
</div>
</div>
<div id="outline-container-org83b7a01" class="outline-3">
<h3 id="org83b7a01"><span class="section-number-3">2.2.</span> Defines</h3>
<div class="outline-text-3" id="text-2-2">
<p>
   Lines that start with '#define macro value', 'macro' being some word, create
standard C-style macros where 'macro' is replaced with 'value' in 
the L-system before parsing starts. They are not as powerful as cpp.
</p>
</div>
</div>
