pages/quick-ref.org
** Settings
   Before the axiom is specified, settings variables can be set for the L-system. 
The following settings can be used to control default/initial L-system values, 
using standard syntax, i.e. var = value. Multiple settings on the same line must be
separated by a semi-colon.\\
   Note that the view setting is a JS object with the properties
'position' and 'target', whose values are JS arrays of X,Y,Z coordinates.
|--------- | --------------------------------------------------------------  |
| *stemsize* | width of extrusion. default: 0.1                               |
| *delta*  | angle in degrees of yaw, pitch, and roll. default: 90          |
| *step*   | distance traveled by F,f,G,g modules. default: 1               |
| *view*   | *position:* 3D position of viewer/camera.                      |
|          | *target:* 3D position of view/camera target.                   |
|          | e.g. view = {position: [20,20,5], target: [0,8,0]}             |
|          | --- or ---                                                     |
|          | auto: direction                                                |
|          | where direction is one of 'X', '-X', 'Y', '-Y', 'Z', '-Z', or  |
|          | a direction array defining where the camera position should    |
|          | be. The target is always the center of the bounding sphere     |
|          | of the drawn geometry and the distance from the target is      |
|          | about twice the radius of the bounding sphere.                 |
|          | e.g. view = {auto: 'y'} will look down on the XY plane. Note,  |
|          | case-insensitivity and quotes. Or,                             |
|          | view = {auto: [1,1,1]} will place the camera on a line through |
|          | the target center parallel to the vector 1,1,1, looking at the |
|          | target                                                         |
|          | The default view is {auto: 'X'}                                |

** Variables
   Variables used in the L-system can be set and used in the rules. If you define and 
set a  variable before the lsystem: keyword, it will be global across the main L-system 
and any sub-L-systems. If the variable is set after the lsystem: keyword, it is local
to that L-system. Module parameter variables are local to the rule they are used in.
However, since global and L-system local variables can be used in rule expressions 
along with module parameters, it's best not to have name conflicts.
   For example if you have a parameterized module like, A(t), then defining a global or 
L-system scope variable, t, may cause you grief. LS Explorer uses a dynamic scoping
mechanism where it looks for variables first in rule scope, then L-system scope, and,
finally, global scope.
** Expressions
   Expressions occur in tests, parameters, and pre/post test; they follow
 mathjs syntax: [[https://mathjs.org/docs/expressions/syntax.html][Expression syntax for mathjs]].

  Of particular note, are the logical operators which must be written explicitly as
| and | instead of '&&'|
| or | instead of '\vert\vert' |
| not | instead of '!' |
   e.g. "(t > 0) and not u", instead of "(t > 0) && !u"
* UI and controls
  - subject to constant change -
** L-system controls
  Here, you can load an L-system file from disk or enter one manually in the text area.
  Below the choose file entry are controls to build, step, parse, rewrite, and draw the L-system.
 - *Choose File* allows you to load an lsystem locally. It is a text file, typically with a .ls extension
 - *Save LS* allows you to save the L-system text file.

 - *Build* will clear geometry, reset the turtle, re-parse, and rewrite the L-system  before drawing.
 - *Step* will do one iteration step of the the L-system, i.e. one rewrite step and one draw, no matter how
  many interations are specified in the L-system spec. As a special case, if the *Parse* button is used to
  reparse and recreate the L-system, *Step* will initially write and interpret just the axiom; subsequent steps
  will clear the previous geometry, rewrite one step of the L-system, and redraw it. 
 - *Parse* this button will parse whatever text is in the L-system source area, re-create the current L-system
  and show the result in the L-system Expansion text box. If you make changes to the L-system, choose this first.
 - *Rewrite* will rewrite the parsed L-system, and, again, place the result in the L-system Expansion box.
 - *Draw* will interpret the expanded system and draw the geometry on the canvas. Note, that *Draw* neither
  clears, nor resets any previously drawn geometry.
 - *Gen Code* causes the interpretation to generate the turtle code that it uses to draw the geometry. This 
  is simpler in single turtle mode. This should run standalone (with the Turtle3d class) to generate the geometry
 - *Save LS file* allows you to save the text of the L-system description as a .ls file.
 - *Save Model* allows you to save drawn geometry to a .babylon or GLTF/GLB file.
 - *MultiTurtle?* is a checkbox to turn this mode on/off. When on, the interpretation/drawing creates a new
  turtle for each branch and then gives each turtle one step on its branch in a round-robin draw mode. When
  a turtle reaches the end of the branch it is destroyed. This mode typically appears more natural, however
  there are some TABOP nested polygon productions that do not work in this mode, so it's best to turn it off
  when using polygon geometry.

Below the L-system source box are status and more controls:

 - *L-system status:* |X|Y|Z| , where X is the number of iterations/expansions of the axiom; Y is the number
  of modules in the L-system expansion, and Z is the number of modules that have been interpreted/drawn. This
  last box will turn green when drawing is complete.
 - *Draw Speed* is an input to control the drawing speed in modules/frame. It defaults to 200 and runs from
  1 to 500. Higher rates tend to bog down the browser.

 - *Save Code* allows you to save that generated code.
