pages/quick-ref.html
<div id="outline-container-orgf179b72" class="outline-3">
<h3 id="orgf179b72"><span class="section-number-3">2.3.</span> Settings</h3>
<div class="outline-text-3" id="text-2-3">
<p>
   Before the axiom is specified, settings variables can be set for the L-system. 
The following settings can be used to control default/initial L-system values, 
using standard syntax, i.e. var = value. Multiple settings on the same line must be
separated by a semi-colon.<br />
   Note that the view setting is a JS object with the properties
'position' and 'target', whose values are JS arrays of X,Y,Z coordinates.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>stemsize</b></td>
<td class="org-left">width of extrusion. default: 0.1</td>
</tr>

<tr>
<td class="org-left"><b>delta</b></td>
<td class="org-left">angle in degrees of yaw, pitch, and roll. default: 90</td>
</tr>

<tr>
<td class="org-left"><b>step</b></td>
<td class="org-left">distance traveled by F,f,G,g modules. default: 1</td>
</tr>

<tr>
<td class="org-left"><b>view</b></td>
<td class="org-left"><b>position:</b> 3D position of viewer/camera.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><b>target:</b> 3D position of view/camera target.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e.g. view = {position: [20,20,5], target: [0,8,0]}</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#x2014; or ---</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">auto: direction</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">where direction is one of 'X', '-X', 'Y', '-Y', 'Z', '-Z', or</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">a direction array defining where the camera position should</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">be. The target is always the center of the bounding sphere</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">of the drawn geometry and the distance from the target is</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">about twice the radius of the bounding sphere.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e.g. view = {auto: 'y'} will look down on the XY plane. Note,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">case-insensitivity and quotes. Or,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">view = {auto: [1,1,1]} will place the camera on a line through</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">the target center parallel to the vector 1,1,1, looking at the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">target</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">The default view is {auto: 'X'}</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9c30a0f" class="outline-3">
<h3 id="org9c30a0f"><span class="section-number-3">2.4.</span> Variables</h3>
<div class="outline-text-3" id="text-2-4">
<p>
   Variables used in the L-system can be set and used in the rules. If you define and 
set a  variable before the lsystem: keyword, it will be global across the main L-system 
and any sub-L-systems. If the variable is set after the lsystem: keyword, it is local
to that L-system. Module parameter variables are local to the rule they are used in.
However, since global and L-system local variables can be used in rule expressions 
along with module parameters, it's best not to have name conflicts.
   For example if you have a parameterized module like, A(t), then defining a global or 
L-system scope variable, t, may cause you grief. LS Explorer uses a dynamic scoping
mechanism where it looks for variables first in rule scope, then L-system scope, and,
finally, global scope.
</p>
</div>
</div>
<div id="outline-container-org1922295" class="outline-3">
<h3 id="org1922295"><span class="section-number-3">2.5.</span> Expressions</h3>
<div class="outline-text-3" id="text-2-5">
<p>
  Expressions occur in tests, parameters, and pre/post test; they follow
mathjs syntax: <a href="https://mathjs.org/docs/expressions/syntax.html">Expression syntax for mathjs</a>.
</p>

<p>
Of particular note, are the logical operators which must be written explicitly as
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">and</td>
<td class="org-left">instead of '&amp;&amp;'</td>
</tr>

<tr>
<td class="org-left">or</td>
<td class="org-left">instead of '&vert;&vert;'</td>
</tr>

<tr>
<td class="org-left">not</td>
<td class="org-left">instead of '!'</td>
</tr>
</tbody>
</table>
<p>
e.g. "(t &gt; 0) and not u", instead of "(t &gt; 0) &amp;&amp; !u"
</p>
</div>
</div>
</div>
<div id="outline-container-org3d60cae" class="outline-2">
<h2 id="org3d60cae"><span class="section-number-2">3.</span> UI and controls</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>subject to constant change -</li>
</ul>
</div>
<div id="outline-container-org0e99d0f" class="outline-3">
<h3 id="org0e99d0f"><span class="section-number-3">3.1.</span> L-system controls</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Here, you can load an L-system file from disk or enter one manually in the text area.
Below the choose file entry are controls to build, step, parse, rewrite, and draw the L-system.
</p>
<ul class="org-ul">
<li><b>Choose File</b> allows you to load an lsystem locally. It is a text file, typically with a .ls extension</li>
<li><b>Save LS</b> allows you to save the L-system text file.</li>

<li><b>Build</b> will clear geometry, reset the turtle, re-parse, and rewrite the L-system  before drawing.</li>
<li><b>Step</b> will do one iteration step of the the L-system, i.e. one rewrite step and one draw, no matter how
many interations are specified in the L-system spec. As a special case, if the <b>Parse</b> button is used to
reparse and recreate the L-system, <b>Step</b> will initially write and interpret just the axiom; subsequent steps
will clear the previous geometry, rewrite one step of the L-system, and redraw it.</li>
<li><b>Parse</b> this button will parse whatever text is in the L-system source area, re-create the current L-system
and show the result in the L-system Expansion text box. If you make changes to the L-system, choose this first.</li>
<li><b>Rewrite</b> will rewrite the parsed L-system, and, again, place the result in the L-system Expansion box.</li>
<li><b>Draw</b> will interpret the expanded system and draw the geometry on the canvas. Note, that <b>Draw</b> neither
clears, nor resets any previously drawn geometry.</li>
<li><b>Gen Code</b> causes the interpretation to generate the turtle code that it uses to draw the geometry. This 
is simpler in single turtle mode. This should run standalone (with the Turtle3d class) to generate the geometry</li>
<li><b>Save LS file</b> allows you to save the text of the L-system description as a .ls file.</li>
<li><b>Save Model</b> allows you to save drawn geometry to a .babylon or GLTF/GLB file.</li>
<li><b>MultiTurtle?</b> is a checkbox to turn this mode on/off. When on, the interpretation/drawing creates a new
turtle for each branch and then gives each turtle one step on its branch in a round-robin draw mode. When
a turtle reaches the end of the branch it is destroyed. This mode typically appears more natural, however
there are some TABOP nested polygon productions that do not work in this mode, so it's best to turn it off
when using polygon geometry.</li>
</ul>

<p>
Below the L-system source box are status and more controls:
</p>

<ul class="org-ul">
<li><b>L-system status:</b> |X|Y|Z| , where X is the number of iterations/expansions of the axiom; Y is the number
of modules in the L-system expansion, and Z is the number of modules that have been interpreted/drawn. This
last box will turn green when drawing is complete.</li>
<li><b>Draw Speed</b> is an input to control the drawing speed in modules/frame. It defaults to 200 and runs from
1 to 500. Higher rates tend to bog down the browser.</li>

<li><b>Save Code</b> allows you to save that generated code.</li>
</ul>
</div>
</div>
