pages/quick-ref.org
** Turtle controls
  Below the L-system controls are the turtle controls. To the right of the label, "Turtle Controls" is a widget
  that will expand and collapse the controls. The first expansion is a buttonbar that controls the
  default turtle. If you open the Javascript console, you can directly enter Turtle3d commands to get 
  an idea for how it works. You can also turn on the Gen Code mode to get examples of how the turtle 
  is used. 

 - *Hide/Show* will hide or show the turtle shape, which is a mini axis of the HLU system of the turtle.
 - *Home* moves the turtle back to 0,0,0 and orients it along the axes.
 - *Reset* is the same as *Clear* and *Home*
 - *Clear* will clear all the geometry generated by the turtle(s).
 - *Look at Turtle* orients the camera so the turtle is in the center of view, or you can pick the origin, or
  the center of the drawn geometry bounding sphere.
 - *Show/Hide Color Table* displays the current color/material table
** Scene Controls   
   Here you can toggle visibility of the Ground, Sky, and coordinate axes. You can also 'look at'
   the turtle, the current origin for the turtle, or the center of the mesh bounding sphere:
   helpful if you've lost track of where you are when navigating around.
-----

