pages/quick-ref.html
<div id="outline-container-orgc248b0c" class="outline-3">
<h3 id="orgc248b0c"><span class="section-number-3">3.2.</span> Turtle controls</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Below the L-system controls are the turtle controls. To the right of the label, "Turtle Controls" is a widget
that will expand and collapse the controls. The first expansion is a buttonbar that controls the
default turtle. If you open the Javascript console, you can directly enter Turtle3d commands to get 
an idea for how it works. You can also turn on the Gen Code mode to get examples of how the turtle 
is used. 
</p>

<ul class="org-ul">
<li><b>Hide/Show</b> will hide or show the turtle shape, which is a mini axis of the HLU system of the turtle.</li>
<li><b>Home</b> moves the turtle back to 0,0,0 and orients it along the axes.</li>
<li><b>Reset</b> is the same as <b>Clear</b> and <b>Home</b></li>
<li><b>Clear</b> will clear all the geometry generated by the turtle(s).</li>
<li><b>Look at Turtle</b> orients the camera so the turtle is in the center of view, or you can pick the origin, or
the center of the drawn geometry bounding sphere.</li>
<li><b>Show/Hide Color Table</b> displays the current color/material table</li>
</ul>
</div>
</div>
<div id="outline-container-org44085b1" class="outline-3">
<h3 id="org44085b1"><span class="section-number-3">3.3.</span> Scene Controls</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Here you can toggle visibility of the Ground, Sky, and coordinate axes. You can also 'look at'
the turtle, the current origin for the turtle, or the center of the mesh bounding sphere:
helpful if you've lost track of where you are when navigating around.
</p>
<hr />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-02-07 Wed 20:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
